[
  {
    "id": 1,
    "name": "Соняшникова олія",
    "size": [
      ["100", "200"],
      ["250", "500"],
      ["500", "900"]
    ],
    "description": "Соняшникова олія — одна з найважливіших олій, що має велике господарське значення. У кулінарії застосовується для смаження і для додавання до салатів. З неї виробляють маргарин і кулінарні жири (шляхом гідрування). Соняшникова олія застосовується для виготовлення консервів, а також у миловарінні та лакофарбовій промисловості. Соняшникова олія входить до складу різних мазей.",
    "icon": "soniashnykova.png",
    "photo": "1.jpg"
  },
  {
    "id": 2,
    "name": "Кокосова олія",
    "size": [
      ["250", "500"],
      ["500", "900"]
    ],
    "description": "Натуральне масло м'якоті кокоса містить безліч поживних жирів, амінокислот, мікроелементів. При регулярному вживанні воно зміцнює імунну систему, а також покращує стан шкіри, запобігає раннє клітинне старіння, робить волосся блискучим і густими.",
    "icon": "kokosova.png",
    "photo": "1.jpg"
  },
  {
    "id": 3,
    "name": "Лляна олія",
    "size": [
      ["100", "200"],
      ["250", "500"],
      ["500", "900"]
    ],
    "description": "Олія льону — це і їжа, і ліки, і косметика. Будь-яка красуня в минулому знала, що вживання в їжу лляної олії, в поєднанні з використанням тієї ж олії як живильного крему (лляну олію дуже добре поглинає шкіра) надає шкірі і волоссю здорового вигляду і допомагає зберегти молодість[7].",
    "icon": "lniana.png",
    "photo": "1.jpg"
  },
  {
    "id": 4,
    "name": "Мигдалева олія",
    "size": [
      ["100", "200"],
      ["250", "500"],
      ["500", "900"]
    ],
    "description": "Олія мигдалю - дійсно унікальний продукт. Йому знайшли застосування в найрізноманітніших сферах. Нею активно користуються досвідчені косметологи, лікарі та навіть кулінари. Завдяки високій концентрації біологічно активних речовин (жирів, органічних кислот, фітостеринів, дубильних речовин, вітамінів) чинить на організм протизапальну, ранозагоювальну, обволікаючу, протисудомну та проносну дію.",
    "icon": "mugdaleva.png",
    "photo": "1.jpg"
  },
  {
    "id": 5,
    "name": "Гарбузова олія",
    "size": [
      ["100", "200"],
      ["250", "500"],
      ["500", "900"]
    ],
    "description": "Гарбузова олія зміцнює імунітет, підвищує стійкість до інфекційних та вірусних захворювань. Має антисептичні властивості, тож її застосовують для профілактики різних запалень. Олія насіння гарбуза захищає організм від впливу вільних радикалів і раннього старіння. Вона знижує рівень холестерину в крові, попереджає утворення каменів у жовчному міхурі, нормалізує роботу нирок. Людям із порушеннями ліпідного обміну, що збільшує ризик виникнення ожирінн та інших захворювань, теж рекомендують вживати олію гарбуза.",
    "icon": "harbyzova.png",
    "photo": "1.jpg"
  },
  {
    "id": 6,
    "name": "Олія волоського горіха",
    "size": [
      ["100", "200"],
      ["250", "500"],
      ["500", "900"]
    ],
    "description": "Олія грецького горіха лікує псоріаз, та виразки, покращує стан шкіри, волосся, нігтів, має глистогінну та протипухлинну дію, сприяє відновленню організму людини після важких операцій, травм та хвороб. Мікроелементи та мінерали відновлюють імунітет організму людини.",
    "icon": "voloskiy.png",
    "photo": "1.jpg"
  }
]
