import styles from "./styles.module.scss";

export default function DogovirOfertu() {
  return (
    <div className={styles.container}>
      <h1>ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА)</h1>
      <p>
        Цей договір є офіційною та публічною пропозицією Продавця укласти
        договір купівлі-продажу Товару, представленого на сайті Matolli.com.ua
        та в соціальних мережах. Даний договір є публічним, тобто відповідно до
        статті 633 Цивільного кодексу України, його умови є однаковими для всіх
        покупців незалежно від їх статусу (фізична особа, юридична особа,
        фізична особа-підприємець) без надання переваги одному покупцю перед
        іншим. Шляхом укладення цього Договору Покупець в повному обсязі приймає
        умови та порядок оформлення замовлення, оплати товару, доставки товару,
        повернення товару, відповідальності за недобросовісне замовлення та усі
        інші умови договору. Договір вважається укладеним з моменту натискання
        кнопки «Замовити» на сторінці оформлення замовлення в розділі «Кошик»
      </p>
      <h2>1. Визначення термінів</h2>
      <ul>
        <li>
          1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця,
          адресована невизначеному колу осіб, укласти з Продавцем договір
          купівлі-продажу товару дистанційним способом (далі - «Договір») на
          умовах, що містяться в цій Оферті.
        </li>
        <li>
          1.2. Товар – об'єкт угоди сторін, який був обраний покупцем на сайті
          Інтернет-магазину та поміщений у «Кошик», або вже придбаний Покупцем у
          Продавця дистанційним способом.
        </li>
        <li>
          1.3. Інтернет-магазин – сайт Продавця за адресою www. Matolli.com.ua
          створений для укладення договорів купівлі-продажу на підставі
          ознайомлення Покупця із запропонованим Продавцем описом Товару за
          допомогою мережі Інтернет.
        </li>
        <li>1.4. Покупець – дієздатна фізична особа, яка досягла 18 років.</li>
        <li>
          1.5. Продавець – фізично особа підприємець «Матусець Г.В.»
          (ідентифікаційний код 3198615827), яка створена і діє відповідно до
          чинного законодавства України, місцезнаходження якої: 79491, м. Львів,
          вул. Балабанівка, буд. 9.
        </li>
      </ul>
      <h2>2. Предмет Договору</h2>
      <ul>
        <li>
          2.1. Продавець зобов’язується передати у власність Покупцю Товар, а
          Покупець натиснувши на кнопку «Замовити» в розділі «Кошик», на умовах
          цього Договору зобов’язується здійснити передоплату в розмірі 100%
          вартості Товару.
        </li>
        <li>
          2.2. Датою укладення Договору-оферти (акцептом оферти) та моментом
          повного й беззаперечного прийняттям Покупцем умов Договору вважається
          дата заповнення Покупцем форми замовлення, розташованої на сайті
          Інтернет-магазину.
        </li>
      </ul>
      <h2>3. Оформлення Замовлення</h2>
      <ul>
        <li>
          3.1. Покупець самостійно оформлює замовлення в Інтернет-магазину через
          форму «Кошика», або за номером телефону, вказаним в розділі контактів
          Інтернет-магазину.
        </li>
        <li>
          3.2. Продавець має право відмовитися від передання замовлення
          Покупцеві у випадку, якщо відомості, вказані Покупцем під час
          оформлення замовлення, є неповними або викликають підозру щодо їх
          дійсності.
        </li>
        <li>
          3.3. При оформленні замовлення на сайті Інтернет-магазину Покупець
          зобов'язується надати наступну обов’язкову інформацію, необхідну
          Продавцю для виконання замовлення:
          <ul>
            <li>3.3.1. прізвище, ім'я Покупця;</li>
            <li>
              3.3.2. адреса, за якою слід доставити Товар (якщо доставка до
              адреси Покупця);
            </li>
            <li>3.3.3. контактний телефон.</li>
          </ul>
        </li>
        <li>
          3.4. Найменування, кількість, ціна обраного Покупцем Товару вказуються
          в Кошику Покупця на сайті Інтернет-магазину.
        </li>
        <li>
          3.5. Якщо будь-якої із Сторін договору необхідна додаткова інформація,
          він має право запросити її у іншій Стороні. У разі ненадання
          необхідної інформації Покупцем, Продавець не несе відповідальності за
          надання якісної послуги Покупцю при покупці товару в
          інтернет-магазині.
        </li>
        <li>
          3.6. При оформленні замовлення через оператора Продавця (п. 3.1. Цієї
          Оферти) Покупець зобов'язується надати інформацію, зазначену в п. 3.3
          – 3.4. цієї Оферти.
        </li>
        <li>
          3.6. Ухвалення Покупцем умов цієї Оферти здійснюється за допомогою
          внесення Покупцем відповідних даних в реєстраційну форму на сайті
          Інтернет-магазину або при оформленні Замовлення через оператора. Після
          оформлення Замовлення через Оператора дані про Покупця вносяться до
          бази даних Продавця.
        </li>
        <li>
          3.7. Покупець несе відповідальність за достовірність наданої
          інформації при оформленні Замовлення.
        </li>
        <li>
          3.7. Покупець несе відповідальність за достовірність наданої
          інформації при оформленні Замовлення.
          <ul>
            <li>
              а) Покупець цілком і повністю ознайомлений, і згоден з умовами
              цієї пропозиції (оферти);
            </li>
            <li>
              б) він дає дозвіл на збір, обробку та передачу персональних даних,
              дозвіл на обробку персональних даних діє протягом усього терміну
              дії Договору, а також протягом необмеженого терміну після
              закінчення його дії. Крім цього, укладенням договору Покупець
              підтверджує, що він повідомлений (без додаткового повідомлення)
              про права, встановлених Законом України "Про захист персональних
              даних", про цілі збору даних, а також про те, що його персональні
              дані передаються Продавцю з метою можливості виконання умов цього
              Договору, можливості проведення взаєморозрахунків, а також для
              отримання рахунків, актів та інших документів. Покупець також
              погоджується з тим, що Продавець має право надавати доступ та
              передавати його персональні дані третім особам без будь-яких
              додаткових повідомлень Покупця з метою виконання замовлення
              Покупця. Обсяг прав Покупця, як суб'єкта персональних даних
              відповідно до Закону України "Про захист персональних даних" йому
              відомий і зрозумілий.
            </li>
          </ul>
        </li>
        <h2>4. Ціна і Доставка Товару</h2>
        <ul>
          <li>
            4.1 Ціни на Товари визначаються Продавцем самостійно та вказані на
            сайті Інтернет-магазину. Всі ціни на Товари вказані на сайті у
            гривнях.
          </li>
          <li>
            4.2 Ціни на Товари можуть змінюватися Продавцем в односторонньому
            порядку залежно від кон'юнктури ринку. При цьому ціна окремої
            одиниці Товару, вартість якої оплачена Покупцем в повному обсязі, не
            може бути змінена Продавцем в односторонньому порядку.
          </li>
          <li>
            4.3. Вартість Товару, яка вказана на сайті Інтернет-магазину не
            включає в себе вартість доставки Товару Покупцю. Вартість доставки
            Товару Покупець сплачує відповідно до діючих тарифів служб доставки
            (перевізників) безпосередньо обраній ним службі доставки
            (перевізнику).
          </li>
          <li>
            4.4. Вартість Товару яка вказана на сайті Інтернет-магазину не
            включає в себе вартість доставки Товару на адресу Покупця.
          </li>
          <li>
            4.5. Зобов'язання Покупця по оплаті Товару вважаються виконаними з
            моменту надходження Продавцю коштів на його рахунок.
          </li>
          <li>
            4.6. Розрахунки між Продавцем і Покупцем за Товар здійснюються
            способами, зазначеними на сайті Інтернет-магазину в розділі «Оплата
            і Доставка».
          </li>
          <li>
            4.7. При отриманні товару Покупець повинен у присутності
            представника служби доставки (перевізника) перевірити відповідність
            Товару якісним і кількісним характеристикам (найменування товару,
            кількість, термін придатності).
          </li>
          <li>
            4.8. Покупець або його представник під час приймання Товару
            підтверджує своїм підписом в товаро транспортній накладній на
            доставку товарів, що не має претензій до кількості товару, зовнішнім
            виглядом і комплектності товару.
          </li>
          <li>
            4.9. Право власності та ризик випадкової втрати або пошкодження
            Товару переходить до Покупця або його Представника з моменту
            отримання Товару Покупцем в місті поставки Товару при самостійній
            доставки Товару від Продавця, чи під час передачі Продавцем товару
            службі доставки (перевізнику) обраної Покупцем.
          </li>
        </ul>
        <h2>5. Права та обов’язки Сторін</h2>
        <ul>
          <li>
            5.1. Продавець зобов’язаний:
            <ul>
              <li>
                5.1.1. Передати Покупцеві Товар у відповідності до умов цього
                Договору та замовлення Покупця.{" "}
              </li>
              <li>
                5.1.2. Не розголошувати будь-яку приватну інформацію про Покупця
                і не надавати доступ до цієї інформації третім особам, за
                винятком випадків, передбачених законодавством та під час
                виконання Замовлення Покупця.
              </li>
            </ul>
          </li>
          <li>
            5.2. Продавець має право:
            <ul>
              <li>
                5.2.1 Змінювати умови цього Договору, а також ціни на Товари, в
                односторонньому порядку, розміщуючи їх на сайті
                Інтернет-магазину. Всі зміни набувають чинності з моменту їх
                публікації.
              </li>
            </ul>
          </li>
          <li>
            5.3 Покупець зобов'язується:
            <ul>
              <li>
                5.3.1 До моменту укладення Договору ознайомитися зі змістом
                Договору, умовами Договору і цінами, запропонованими Продавцем
                на сайті Інтернет-магазину.
              </li>
              <li>
                5.3.2 На виконання Продавцем своїх зобов'язань перед Покупцем
                останній повинен повідомити всі необхідні дані, що однозначно
                ідентифікують його як Покупця, і достатні для доставки Покупцеві
                замовленого Товару.
              </li>
            </ul>
          </li>
        </ul>
        <h2>6. Повернення Товару</h2>
        <ul>
          <li>
            6.1. Згідно постанови кабінету міністрів України від 19.03.1994 року
            №172 – продукти харчування з нормальним терміном придатності і
            належної якості обміну та поверненню не підлягають. Продукти
            харчування неналежної якості (браковані, зіпсовані) підлягають
            поверненню та обміну за умови недотримання Продавцем умов продажу
            Товару – якщо продукт був відразу бракований, а не при
            транспортуванні або зберіганні на складах Перевізників.
          </li>
          <li>
            6.2. Згідно із законодавством, при поверненні товару розрахунки з
            Покупцем проводяться виходячи з вартості Товару на момент покупки.
            За домовленістю з Покупцем, Продавець можете провести обмін на товар
            за тією ж вартістю або з перерахунком ціни.
          </li>
          <li>
            6.3. Повернення коштів за Товар повинні бути повернуті тим самим
            способом Покупцю.
          </li>
          <li>
            6.4. Повернення Товару неналежної якості здійснюється за адресою
            Продавця, та здійснюється за рахунок Продавця.
          </li>
          <li>
            6.5. Розгляд вимог, передбачених Законом України «Про захист прав
            споживачів», провадиться Продавцем за умови надання Покупцем
            документів, передбачених чинним законодавством України. Продавець не
            відповідає за недоліки Товару, які виникли після його передання
            Покупцеві внаслідок порушення Покупцем правил користування або
            зберігання Товару, дій третіх осіб або непереборної сили.
          </li>
        </ul>
        <h2>7. Відповідальність</h2>
        <ul>
          <li>
            7.1. Продавець не несе відповідальності за неналежне, несвоєчасне
            виконання Замовлень і своїх зобов’язань у випадку надання Покупцем
            недостовірної або помилкової інформації.
          </li>
          <li>
            7.2. Продавець і Покупець несуть відповідальність за виконання своїх
            зобов'язань відповідно до чинного законодавства України і положень
            цього Договору.
          </li>
        </ul>
        <h2>8. Конфіденційність і захист персональних даних</h2>
        <ul>
          <li>
            8.1. Надаючи свої персональні дані на сайті Інтернет-магазину при
            реєстрації або оформленні Замовлення, Покупець надає Продавцеві свою
            добровільну згоду на обробку, використання (у тому числі і передачу)
            своїх персональних даних, а також вчинення інших дій, передбачених
            Законом України «Про захист персональних даних», без обмеження
            терміну дії такої згоди.
          </li>
          <li>
            8.2. Продавець зобов'язується не розголошувати отриману від Покупця
            інформацію. Не вважається порушенням надання Продавцем інформації
            контрагентам і третім особам, що діють на підставі договору з
            Продавцем, в тому числі і для виконання зобов'язань перед Покупцем,
            а також у випадках, коли розкриття такої інформації встановлено
            вимогами чинного законодавства України.
          </li>
          <li>
            8.3. Покупець несе відповідальність за підтримання своїх
            персональних даних в актуальному стані. Продавець не несе
            відповідальності за неякісне виконання або невиконання своїх
            зобов'язань у зв'язку з неактуальністю інформації про Покупця або
            невідповідністю її дійсності.
          </li>
        </ul>
        <h2>9. Інші умови</h2>
        <ul>
          <li>
            9.1. Цей договір укладено на території України і діє відповідно до
            чинного законодавства України.
          </li>
          <li>
            9.2. Усі спори, що виникають між Покупцем і Продавцем, вирішуються
            шляхом переговорів. У випадку недосягнення врегулювання спірного
            питання шляхом переговорів, Покупець та/або Продавець мають право
            звернутися за вирішенням спору до судових органів відповідно до
            чинного законодавства України.
          </li>
          <li>
            9.3. Продавець має право вносити зміни до цього Договору в
            односторонньому порядку, передбаченому п. 5.2.1. Договору. Крім
            того, зміни до Договору також можуть бути внесені за взаємною згодою
            Сторін в порядку, передбаченому чинним законодавством України.
          </li>
        </ul>
      </ul>
    </div>
  );
}
